Vulnerability Test Results/artillery-load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 10
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up to 100 VUs"
    - duration: 40
      arrivalRate: 100
      name: "Sustained Baseline Load (100 VUs)"
    - duration: 10
      arrivalRate: 10
      name: "Ramp down"
  defaults:
    headers:
      User-Agent: "Artillery-MediFind-LoadTest/1.0"
      Content-Type: "application/json"

scenarios:
  - name: "MediFind Core Browsing & API Load User Flow"
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200
      - get:
          url: "/api/medicines"
          expect:
            - statusCode: 200
      - get:
          url: "/api/pharmacies"
          expect:
            - statusCode: 200
      - get:
          url: "/api/admin/stats"
          expect:
            - statusCode: 200
